In [36]:
import pandas as pd
from citipy import citipy
import numpy as np

In [3]:
file1 = "Resources/Original_Data/account_ownership_clean.csv"
file2 = "Resources/Original_Data/IncomePerCapita_clean.csv"
file3 = "Resources/Original_Data/mobile_subscriptions_clean.csv"

In [4]:
df1 = pd.read_csv(file1)
df2 = pd.read_csv(file2)
df3 = pd.read_csv(file3)

In [6]:
df = [df1,df2,df3]
#df

[           Country name    2011 AO    2014 AO    2017 AO
 0           Afghanistan   9.005013   9.961000  14.893312
 1               Albania  28.268126  37.986355  40.015171
 2               Algeria  33.286114  50.475788  42.776627
 3            Arab World  22.260538  30.277130  37.165211
 4             Argentina  33.130219  50.197296  48.708488
 ..                  ...        ...        ...        ...
 123       Venezuela, RB  44.116661  57.026325  73.494507
 124             Vietnam  21.369493  30.950945  30.795792
 125  West Bank and Gaza  19.428032  24.243807  25.022177
 126              Zambia  21.364910  35.644871  45.863258
 127            Zimbabwe  39.651211  32.389252  55.285137

 [128 rows x 4 columns],
      Country name  2011 PCI   2014 PCI  2017 PCI
 0           Aruba      19982     22913     24400
 1     Afghanistan        519       532       488
 2          Angola       1500      2398      1756
 3         Albania       3667      3775      3673
 4      Arab World       5389      6041      5153
 ..            ...        ...       ...       ...
 204         Samoa       3342      3359      3656
 205   Yemen, Rep.       1027      1418       842
 206  South Africa       6382      5168      4957
 207        Zambia       1140      1321      1104
 208      Zimbabwe        793      1134      1233

 [209 rows x 4 columns],
            Country name   2011 SUBS   2014 SUBS   2017 SUBS
 0           Afghanistan    13797900    18407200    23929700
 1               Albania     3100000     3359650     3625700
 2               Algeria    35615900    43298200    45845700
 3               Andorra       65044       66241       80337
 4                Angola    12073200    14052600    13324000
 ..                  ...         ...         ...         ...
 227  West Bank and Gaza     2884960     3197550     3996210
 228               World  5890569241  6999953386  7750613241
 229         Yemen, Rep.    11668000    17100000    15357900
 230              Zambia     8164550    10114900    13438500
 231            Zimbabwe     9200000    11798700    14092100

 [232 rows x 4 columns]]

In [9]:
table = pd.concat(df,join = "outer", axis = 1).fillna(0)
table.head()

,Country name,2011 AO,2014 AO,2017 AO,Country name,2011 PCI,2014 PCI,2017 PCI,Country name,2011 SUBS,2014 SUBS,2017 SUBS
0,Afghanistan,9.005013,9.961000,14.893312,Aruba,19982.0,22913.0,24400.0,Afghanistan,13797900,18407200,23929700
1,Albania,28.268126,37.986355,40.015171,Afghanistan,519.0,532.0,488.0,Albania,3100000,3359650,3625700
2,Algeria,33.286114,50.475788,42.776627,Angola,1500.0,2398.0,1756.0,Algeria,35615900,43298200,45845700
3,Arab World,22.260538,30.277130,37.165211,Albania,3667.0,3775.0,3673.0,Andorra,65044,66241,80337
4,Argentina,33.130219,50.197296,48.708488,Arab World,5389.0,6041.0,5153.0,Angola,12073200,14052600,13324000

In [13]:
df4 = pd.merge(df1,df2,on= "Country name")
df4.head()

  Country name    2011 AO    2014 AO    2017 AO  2011 PCI   2014 PCI  2017 PCI
0  Afghanistan   9.005013   9.961000  14.893312        519       532       488
1      Albania  28.268126  37.986355  40.015171       3667      3775      3673
2      Algeria  33.286114  50.475788  42.776627       3960      4106      3248
3   Arab World  22.260538  30.277130  37.165211       5389      6041      5153
4    Argentina  33.130219  50.197296  48.708488      10957     10434     12344

In [14]:
df5 = pd.merge(df4,df3, on="Country name")
df5.head()

,Country name,2011 AO,2014 AO,2017 AO,2011 PCI,2014 PCI,2017 PCI,2011 SUBS,2014 SUBS,2017 SUBS
0,Afghanistan,9.005013,9.961000,14.893312,519,532,488,13797900,18407200,23929700
1,Albania,28.268126,37.986355,40.015171,3667,3775,3673,3100000,3359650,3625700
2,Algeria,33.286114,50.475788,42.776627,3960,4106,3248,35615900,43298200,45845700
3,Arab World,22.260538,30.277130,37.165211,5389,6041,5153,351957917,415029269,416484296
4,Argentina,33.130219,50.197296,48.708488,10957,10434,12344,60722700,61234200,61897400

In [18]:
df5.duplicated().sum()

1

In [29]:
df5[df5.duplicated(keep=False)]

,Country name,2011 AO,2014 AO,2017 AO,2011 PCI,2014 PCI,2017 PCI,2011 SUBS,2014 SUBS,2017 SUBS
102,South Asia,32.381943,46.540955,69.559113,1204,1326,1663,1133612138,1271478854,1554226943
103,South Asia,32.381943,46.540955,69.559113,1204,1326,1663,1133612138,1271478854,1554226943

In [21]:
len(df5)

121

In [27]:
df6 = df5.drop_duplicates()

In [28]:
len(df6)

120

In [30]:
df6[df6.duplicated(keep=False)]

Empty DataFrame
Columns: [Country name, 2011 AO, 2014 AO, 2017 AO, 2011 PCI , 2014 PCI, 2017 PCI, 2011 SUBS, 2014 SUBS, 2017 SUBS]
Index: []

In [31]:
#df6.to_csv("Mergerd_table.csv")

In [32]:
df6['Country name']

0      Afghanistan
1          Albania
2          Algeria
3       Arab World
4        Argentina
          ...
116        Uruguay
117     Uzbekistan
118        Vietnam
119         Zambia
120       Zimbabwe
Name: Country name, Length: 120, dtype: object

In [43]:
lat_range = (-90, 90)
lng_range = (-180, 180)

# List for holding lat_lngs and cities
lat_lngs = []
cities = []

# Create a set of random lat and lng combinations
lats = np.random.uniform(lat_range[0], lat_range[1], size=1500)
lngs = np.random.uniform(lng_range[0], lng_range[1], size=1500)
lat_lngs = zip(lats, lngs)

# Identify nearest city for each lat, lng combination
for lat_lng in lat_lngs:
    countries = citipy.nearest_city(lat_lng[0], lat_lng[1]).country_code
    
    # If the city is unique, then add it to a our cities list
    if country not in countries:
        cities.append(country)

# Print the city count to confirm sufficient count
len(countries)

2

In [44]:
countries

'us'